app/views/lectures/_form.html.erb

      <strong class="control-label col-sm-2">Course</strong>
      <% current_user.courses.each do |c| %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = ?  [["user_id", 9]]