app/views/lectures/show.html.erb

<p>
	<%if @lecture.comments.any?%>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."lecture_id" = ? LIMIT 1  [["lecture_id", 8]]