app/views/courses/show.html.erb

    <ul>
    <% @course.lectures.each do |lecture| %>
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."course_id" = ?  [["course_id", 1]]