app/controllers/comments_controller.rb

  def create
    @lecture = Lecture.find(params[:lecture_id])
    @comment = @lecture.comments.build(comment_params)
    @comment.user = current_user
    @comment.save
---
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 8]]
INSERT INTO "comments" ("content", "lecture_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "firstcomment"], ["lecture_id", 8], ["user_id", 9], ["created_at", "2016-05-05 00:05:07.935156"], ["updated_at", "2016-05-05 00:05:07.935156"]]

  def destroy
    @lecture = Lecture.find(params[:lecture_id])
    @comment = @lecture.comments.find(params[:id]).destroy
---
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."lecture_id" = ? AND "comments"."id" = ? LIMIT 1  [["lecture_id", 8], ["id", 1]]