app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT "courses".* FROM "courses"

  def create
    @course = Course.new(course_params)
    @course.user_id=current_user.id

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("title", "course_picture", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "firstNouraCourse"], ["course_picture", ""], ["created_at", "2016-05-03 16:04:38.073329"], ["updated_at", "2016-05-03 16:04:38.073329"]]

  def destroy
    @course.destroy
---
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 7]]

    def set_course
      @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 7]]