app/controllers/lectures_controller.rb

  def download
    my_file = Lecture.find(params[:id]).attached_file.path
---
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 3]]

  def index
    @lectures = Lecture.all
---
SELECT "lectures".* FROM "lectures"

  def create
    @lecture = Lecture.new(lecture_params)
    #@lecture.course_id=current_course.id


    respond_to do |format|
      if @lecture.save
---
INSERT INTO "lectures" ("title", "content", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "firstlecsecondcourse"], ["content", ""], ["course_id", 2], ["created_at", "2016-05-04 07:59:08.782838"], ["updated_at", "2016-05-04 07:59:08.782838"]]

    def set_lecture
      @lecture = Lecture.find(params[:id])
---
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]